# DetailArc Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
DetailArc Class
Members See Also
---
Represents a DetailArc within Autodesk Revit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class DetailArc : DetailCurve
```

Visual Basic
---
```text
Public Class DetailArc _
	Inherits DetailCurve
```

Visual C++
---
```text
public ref class DetailArc : public DetailCurve
```

# Remarks
Currently it's just a place holder for specific type. All the geometry-related functionality is provided by geometry curve object from DetailCurve::geometryCurve property.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..CurveElement Autodesk.Revit.DB..::..DetailCurve Autodesk.Revit.DB..::..DetailArc
# See Also
DetailArc Members
Autodesk.Revit.DB Namespace